Revit 2026 API

# RebarShapeParametersGetAllRebarShapeParameters Method

---

List all shape parameters used by all the existing RebarShapes in the specified document.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ElementId> GetAllRebarShapeParameters(
	Document doc
)
```
```vb
Public Shared Function GetAllRebarShapeParameters (
	doc As Document
) As IList(Of ElementId)
```
```cpp
public:
static IList<ElementId^>^ GetAllRebarShapeParameters(
	Document^ doc
)
```
```fsharp
static member GetAllRebarShapeParameters :
        doc : Document -> IList<ElementId>
```

#### Parameters

doc Document
     The document.

#### Return Value

IListElementId ElementIds corresponding to the external parameters.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method replaces RebarShape.GetAllRebarShapeParameters() from prior releases.

#### Reference

RebarShapeParameters Class

Autodesk.Revit.DB.Structure Namespace